package leedCode;

/**
 *Учитывая два отсортированных массива nums1и nums2размер mи nсоответственно, вернуть медиану двух отсортированных массивов.
 *
 * Общая сложность времени выполнения должна быть O(log (m+n)).
 *
 * Пример 1:
 *
 * Ввод: nums1 = [1,3], nums2 = [2]
 *  Вывод: 2,00000
 *  Объяснение: объединенный массив = [1,2,3] и медиана равна 2.
 * Пример 2:
 *
 * Ввод: nums1 = [1,2], nums2 = [3,4]
 *  Вывод: 2,50000
 *  Объяснение: объединенный массив = [1,2,3,4] и медиана (2 + 3) / 2 = 2,5.
 */
public class FindMedianSortedArrays {
    public static void main(String[] args) {

    }
}
